In [5]:
import pandas as pd
import numpy as np

In [3]:
x=pd.read_csv('studentmarks.csv')
x.head(2)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2

In [5]:
x.tail(3)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [4]:
ser=pd.Series([12,34.6,'12'])
ser

0      12
1    34.6
2      12
dtype: object

#### DATAFRAMES  and dataset both are same .

In [36]:
dic={'A':[1,2,5],'B':[5,8,9],'C':[3,6,9]}
dic

{'A': [1, 2, 5], 'B': [5, 8, 9], 'C': [3, 6, 9]}

In [37]:
df=pd.DataFrame(dic)
df

   A  B  C
0  1  5  3
1  2  8  6
2  5  9  9

In [10]:
df['states']="CA NV AZ".split() # length of the character to be added should be same .

   A  B  C states
0  1  5  3     CA
1  2  8  6     NV
2  5  9  9     AZ

#### HOW TO CREATE NaN VALUES  AND ITS MANIPULATIONS.

In [38]:
dict={'A':[1,np.nan,np.nan],'B':[np.nan,np.nan,np.nan],'C':[1,3,4]}
dict

{'A': [1, nan, nan], 'B': [nan, nan, nan], 'C': [1, 3, 4]}

In [39]:
df1=pd.DataFrame(dict)
df1

     A   B  C
0  1.0 NaN  1
1  NaN NaN  3
2  NaN NaN  4

In [40]:
df1['D']=[20,30,8]
df1

     A   B  C   D
0  1.0 NaN  1  20
1  NaN NaN  3  30
2  NaN NaN  4   8

In [41]:
print("\nDroping any column with a NaN value\n",'-' * 40,sep=' ')


print(df1.dropna(axis=1))       # column wise [ by default it is axis =0 row wise]

Droping any column with a NaN value
 ----------------------------------------
   C   D
0  1  20
1  3  30
2  4   8

##### dropna means deleting both rowwise or columnwise all the Nan values .fillna means filling missing data with value we have assisgned.

In [42]:
print(df1.fillna(value=50))

      A     B  C   D
0   1.0  50.0  1  20
1  50.0  50.0  3  30
2  50.0  50.0  4   8

In [43]:
print(df1.fillna(value=df1['C'].mean()))

          A         B  C   D
0  1.000000  2.666667  1  20
1  2.666667  2.666667  3  30
2  2.666667  2.666667  4   8

# GROUPBY

# DATA MANIPULATION-- SONE GENERAL FUNCTIONS

# pd.melt(dataframe[,id_vars,value_vars,vars_name...])

pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True)[source]



Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

This function is useful to massage a DataFrame into a format where one or more columns are identifier variables (id_vars), while all other columns, considered measured variables (value_vars), are “unpivoted” to the row axis, leaving just two non-identifier columns, ‘variable’ and ‘value’.

In [7]:
    
df=pd.DataFrame({'A': {0:'a',1:'b',2:'c'},
                'B': {0:1,1:3,2:5},
                'C': {0:2,1:4,2:6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [8]:
pd.melt(df,id_vars=['A'],value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [9]:
df1=pd.DataFrame({'foo':['one','one','one','two','two','two'],
                 'bar':['A','B','C','A','B','C'],
                'baz':[1,2,3,4,5,6],
                'zoo':['x','y','z','q','w','t']})
df1

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

###### pandas.pivot(data, *, index=None, columns=None, values=None)[source]
Return reshaped DataFrame organized by given index / column values.

Reshape data (produce a “pivot” table) based on column values. Uses unique values from specified index / columns to form axes of the resulting DataFrame. This function does not support data aggregation, multiple values will result in a MultiIndex in the columns. See the User Guide for more on reshaping.

In [10]:
df1.pivot(index='foo',columns='bar',values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

###### pivot_table (data[,values,index,columns,...])
 it create a spreadsheet style pivot tabler as a dataframe .
 
 The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

In [16]:
df2=pd.DataFrame({"A":['foo','foo','foo','foo','bar','bar','bar'],
                  "B":['one','one','one','two','one','two','two'],
                  "C":['small','large','small','small','large','small','large'],
                  "D":[1,2,3,4,2,6,7],
                 "E":[2,4,5,6,8,9,0]})
df2

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  small  3  5
3  foo  two  small  4  6
4  bar  one  large  2  8
5  bar  two  small  6  9
6  bar  two  large  7  0

In [17]:
table=pd.pivot_table(df2,values='D',index=['A','B'],columns=['C'],aggfunc=np.sum)

table

C        large  small
A   B
bar one    2.0    NaN
    two    7.0    6.0
foo one    2.0    4.0
    two    NaN    4.0

###### cross_tab(index,columns[,values,rownames,...])

compute a simple cross tabulation of two (or more factors.)

In [20]:
a= np.array(["foo","foo","foo","foo","bar","bar","bar","bar","foo","foo","foo"],dtype=object)

b = np.array(["one","one","one","two","one","one","one","one","two","two","one"],dtype=object)

c =np.array(["dull","dull","shiny","shiny","dull","dull","shiny","shiny","dull","shiny","shiny"],dtype=object)


pd.crosstab(a,[b,c],rownames=['a'],colnames=['b','c'])

b    one        two
c   dull shiny dull shiny
a
bar    2     2    0     0
foo    2     2    1     2

###### cut(x,bins[,right,labels,retbins,....])

bin values into discreate values

Use cut when you need to segment and sort data values into bins. This function is also useful for going from a continuous variable to a categorical variable. For example, cut could convert ages to groups of age ranges.

In [21]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3)

[(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], (0.994, 3.0]]
Categories (3, interval[float64, right]): [(0.994, 3.0] < (3.0, 5.0] < (5.0, 7.0]]